/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "ScreenBase.h"

static void * Screen_ctor (void * _self, va_list * app)
{
	CScreenBase * self = _self;
//	const char * text = va_arg(* app, const char *);
//
//	self -> text = malloc(strlen(text) + 1);
//	assert(self -> text);
//	strcpy(self -> text, text);
	return self;
}

static void * Screen_dtor (void * _self)
{
	CScreenBase * self = _self;

	return self;
}
