/****************************************Copyright (c)**************************************************
**                                开入、开出、模入、模出、传感器等输入输出接口模块
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef IO_ADAPTER_H
#define IO_ADAPTER_H

//////////////////////////////////////////////////////////////////////////
//LED: 运行/通信/告警/故障/


typedef enum LED_IDX
{
	LED_RUN			=0,	//运行
	LED_COMM		=1,	//通信
	LED_ALARM		=2,	//告警
	LED_FAULT   	=3	//故障
}LED_IDX;


//设置所有LED的状态
extern void SetAllLed( INT8U LedVal );

//翻转灯的状态 
extern void TurnLed(INT16U uLedID);

//LED的状态
extern void SetLed( INT8U uLedID,INT8U bState);
extern INT8U GetLed( INT16U uLedID );


//DI
 

//AI
//留给中断调用
extern INT8U CpuGetAinVal( void  );

//在IO扫描任务中用
INT8U GetAinRawVal( INT16U nChNo,INT16U *pRawVal);


extern void HotReset(INT16U reset_type);
 

#endif
