/****************************************Copyright (c)**************************************************
**                                掉电自保持模块
**     铁电存储前部需要有一个控制块结构，用于保存标志位、掉电寄存器的个数，此外MD和MW的保存区分开                          
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef FRAM_WR_H
#define FRAM_WR_H

//初始化
extern INT8U  InitFRamMgrTsk( void );

//擦除 用于液晶操作、或者调试软件控制
//擦除时，需要把相关的区域都擦除掉
INT8U  ErasureFRam( void ); 

//获取铁电的数据，主要由通信模块调用，今后可以在调试软件上面看到FRAM的数据
INT8U GetFRamData(INT32U nPos,INT8U Len,INT8U *pBuf );

 
#endif
