/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#pragma once
#ifndef GUI_CONST_H
#define	GUI_CONST_H
 
typedef enum MENUID                 
{
	ID_SCREEN_NULL=0,			// 无定义窗口ID号
	// 一般画面
	ID_START_SCREEN,			// 启动画面	              静态画面	

 	ID_PASSWORD,                // 密码输入窗口           密码输入窗口
 	ID_MODALDIALOG,             // 信息显示对话框
 	ID_DEFAULT_SCREEN,          // 默认显示界面1          循环显示

	ID_MAIN_SCREEN,                   // 主菜单＋                菜单画面

	ID_VER_SCREEN,                   // 版本信息＋                菜单画面

	ID_INIT_DEFAULT,			// 恢复出厂设置
	//
	ID_REALTIME_VAL , //实时测值
	ID_GATE_CTRL,     //闸门操作
	ID_RUN_STAT,      //闸门运行统计
	ID_VER_INFO,      //版本信息

 	ID_DEVICE_CFG ,   //装置参数
	
	// 定义最大屏幕数
	MAX_SCREEN_ID
}MENUID;

 
// 用户密码
#define PWDEFAULT 0000   
// 超级密码
#define SUPERPW   1234    


#endif
