 /****************************************Copyright (c)**************************************************
**							     
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:   LcdDriver.h
**创   建   人:   Author: admin
**最后修改日期: Created on: 2009-11-15
**描        述:   
**备        注 :   RT-Thread
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

#pragma once
#ifndef LCDDRIVER_H_
#define LCDDRIVER_H_


//定义液晶长宽
#define LCD_WIDTH 240
#define LCD_HEIGHT 128


void TurnOnLcd(void);

void TurnOffLcd(void);

void InitLcd(void);

//以下需要配合
void LCD_SetDisplayPos(INT8U page_address, INT8U col_address);
void LCD_WriteDataApi(INT8U val);

void LCD_ClearScreen(void);

//对液晶写屏
void LCD_WriteData(INT8U x, INT8U y, INT8U val);


#endif /* LCDDRIVER_H_ */
