/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef MSG_BOX_H
#define	MSG_BOX_H
#include "guiconst.h"
#include "global.h"
#include "CtrlBase.h"


// 消息框样式
typedef enum MBBOX_STYLE
{
	LCD_MB_NONE   = 0,    // 无
	LCD_MB_YESNO  = 1,    // 有YES NO按键
	LCD_MB_OK     = 2,    // 有确认按键

	LCD_MB_INFO   = 4,    // 有信息图标
	LCD_MB_WARN   = 8,    // 有告警图标

	LCD_MB_DSP    = 16    // 仅有描述信息，居中显示，每行不超过7个汉字

}MBBOX_STYLE;

typedef struct CMsgBox
{
	CCtrlBase  Base;

 


}CMsgBox;



/************************************************************************/
// 消息显示输出
/************************************************************************/
extern void ShowMsgBoxStr(const char * szMsg, INT8U mode);
extern void ShowMsgBoxID(INT16U  nID, INT8U mode);

 

#endif
