/****************************************Copyright (c)**************************************************
**                                   提供编辑功能，消息框显示功能的窗口   
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef SCREEN_EDIT_H
#define	SCREEN_EDIT_H
#include "guiconst.h"
#include "ScreenBase.h"
#include "MsgBox.h" 
#include "CtrlBase.h"

/* 内部状态 */
typedef enum SCREEN_EDIT_STATE
{
	STATE_NORMAL	=0x00,		//正常状态
	STATE_EDIT		=0x01,		//正在编辑态
	STATE_MSG		=0x02,		//正在弹出消息框状态
	STATE_PASS		=0x04		//正在输入密码状态
}SCREEN_EDIT_STATE;
//提供编辑功能，消息框显示功能的窗口
typedef struct CScreenEdit 
{
	CScreenBase Base;

	/* 内部控件 */
	CEditBoxEx  EditBox;
	CMsgBox    MsgBox;
	INT16U m_nState; 
}CScreenEdit;


 
#endif
