/****************************************Copyright (c)**************************************************
**                                   消息定义
**
**
**
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:
**创   建   人:
**最后修改日期:
**描        述:
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#pragma once

enum GUI_EVENT_TYPE
{
	LCD_WM_INIT=10,                 // 初始化
	LCD_WM_REFRASH,                // 画面重新刷新
	LCD_WM_TIMER,                  // 定时器消息

	
	LCD_WM_KEYDOWN,                // 键盘消息

	LCD_WM_PAINT,                   ///< 参数客户DC
	LCD_WM_NCPAINT,                 ///< 参数窗口DC


	LCD_WM_SPECIAL_EVENT=100    // 特殊消息。具体含义由各个画面定义
};
typedef enum GUI_EVENT_TYPE GuiEventType;

struct GUI_EVENT
{
	INT32U Msg;
	INT32U WParam;
	INT32U LParam;
	INT32U Flag;

	struct GuiListNode Next;
};

typedef struct GUI_EVENT GuiEvent;
