 /****************************************Copyright (c)**************************************************
**							     
**                       所有窗口的消息队列 窗口消息队列在一个线程内               
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:   GuiEvent.c
**创   建   人:   admin
**最后修改日期: 2009-11-12
**描        述:   
**备        注 :
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include <stdlib.h>
#include <string.h>
#include <rtthread.h>
#include "applib.h"
#include "GuiConfig.h"
#include "GuiList.h"
#include "GuiEvent.h"
#include "ScreenBase.h"

struct SCR_EVENT_MGR
{
	GuiEvent *pEvent;
	struct GuiListNode FreeList;
	struct GuiListNode UsedList;
};

typedef struct SCR_EVENT_MGR ScreenEventMgr;

ScreenEventMgr g_aScrEvent;

/*********************************************************************************************************
** 函数名称: InitScrEventList
** 函数名称: InitScrEventList
**
** 功能描述：  
**
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年11月12日
** 备  注:  所有窗口的消息队列
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U InitScrEventList( void )
{
	g_aScrEvent.pEvent = rt_malloc( sizeof(GuiEvent) * GUI_SCR_EVENT_CNT );
	ASSERT(g_aScrEvent.pEvent );
	if (g_aScrEvent.pEvent == NULL)
		return FALSE;


	return TRUE;
}



/*********************************************************************************************************
** 函数名称: SendEvnent
**
** 功能描述： 发送消息，立刻执行
**
** 输　入:
**
** 输　出:
**
** 全局变量:
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年11月12日
** 备  注:
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U SendScreenEvnent( CScreenBase *pScr,INT32U Msg,INT32U wParam,INT32U lPara )
{
	if(pScr == NULL)
		return FALSE;

	switch (Msg)
	{
	case G_EVENT_KEYDOWN:
		ASSERT(pScr->pfnKeyDown);
		if (pScr->pfnKeyDown)
		{
			pScr->pfnKeyDown(pScr,wParam);
		}
		break;
	default:
		ASSERT(FALSE);
		break;
	}
 



	return TRUE;
}
/*********************************************************************************************************
** 函数名称: PostEvnent
**
** 功能描述： 寄送消息，暂存于任务队列中，然后在任务合适的时候执行
**
** 输　入:
**
** 输　出:
**
** 全局变量:
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年11月12日
** 备  注:
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U PostScreenEvnent( CScreenBase *pScr,INT32U Msg,INT32U wParam,INT32U lPara )
{
	if(pScr == NULL)
		return FALSE;

	return TRUE;
}

