/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "includes.h"
#include "DeviceCfgScreen.h" 
#include "StringTable.h"
#include "Message.h"

extern CScreenMgr  g_ScreeLib;

CDevCfgScreen DeviceCfgScreen;




//按键处理函数 
static void OnKeyDownDevCfgScreen(INT16U keyCode)   
{	
	 switch (keyCode)
	 { 
	 case KEY_2:
		 {			 	 // 退出该窗口，进入父窗口
			 SwitchScreen(&g_ScreeLib,DeviceCfgScreen.Base.ParentID);

		 
		 }
		 break;
	 default:
		 break;
	 }
}
 
