/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#pragma  once

#ifndef MAIN_MENU_H
#define	MAIN_MENU_H

#include "CtrlBase.h"

//	描    述 : 启动画面中版本信息画面
//	功    能 : 显示操作模块启动时显示公司版本信息和LOGO
typedef struct CMainMenuScreen 
{
	CScreenBase  Base;
	CLcdMenu  Menu;

 
	 
}CMainMenuScreen;


extern CMainMenuScreen  MainMenuScreen;
//
extern void InitMainMenuScreen(CMainMenuScreen *pScreenExt ); 

 
#endif
