/***********************************************Copyright (c)*********************************************
**                                Guangzou ZLG-MCU Development Co.,LTD.
**                                     
**                                       http://www.zlgmcu.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			    I2CHook.c
** Last modified Date:      2007-10-15
** Last Version:		    1.0
** Descriptions:		    I2c钩子函数
**
**--------------------------------------------------------------------------------------------------------
** Created by:			    lixiaocheng
** Created date:		    2007-10-15
** Version:				    1.0
** Descriptions:		    用户想在I2C中断中处理的代码添加在此钩子函数里即可
**
**--------------------------------------------------------------------------------------------------------
** Modified by:			    
** Modified Date:		    
** Version:				    
** Descriptions:		    
**
*********************************************************************************************************/
#include "includes.h"

/*********************************************************************************************************
** Function name:			i2c0Hook
** Descriptions:			API库自带的I2C0中断服务函数的钩子函数，该函数在I2C0中断服务函数中被调用
**							如果用户要在I2C0中断服务程序中处理别的事情，就可以在该函数中添加代码
** input parameters:		NONE
** Output parameters:       NONE
** Returned value:			NONE
*********************************************************************************************************/
void i2c0Hook (void)
{
	/*  添加用户程序 */
}

/*********************************************************************************************************
** Function name:			i2c1Hook
** Descriptions:			API库自带的I2C1中断服务函数的钩子函数，该函数在I2C1中断服务函数中被调用
**							如果用户要在I2C1中断服务程序中处理别的事情，就可以在该函数中添加代码
** input parameters:		NONE
** Output parameters:       NONE
** Returned value:			NONE
*********************************************************************************************************/
void i2c1Hook (void)
{
	/*  添加用户程序 */
}

/*********************************************************************************************************
** Function name:			i2c2Hook
** Descriptions:			API库自带的I2C2中断服务函数的钩子函数，该函数在I2C2中断服务函数中被调用
**							如果用户要在I2C2中断服务程序中处理别的事情，就可以在该函数中添加代码
** input parameters:		NONE
** Output parameters:       NONE
** Returned value:			NONE
*********************************************************************************************************/
void i2c2Hook (void)
{
	/*  添加用户程序 */
}

/*********************************************************************************************************
   END FILE
*********************************************************************************************************/
