/****************************************Copyright (c)**************************************************
**                                  液晶底层驱动      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef LCD_DRIVE_H
#define	LCD_DRIVE_H


//定义液晶长宽
#define LCD_WIDTH    122
#define LCD_HEIGHT   32


/******************* 按键地址 ************************************************/
#define KEY1        0x003f  
#define KEY2        0x005f 
#define KEY3        0x006f  
#define KEY4        0x0077  
#define KEY5        0x007b
#define KEY6        0x007d
#define KEY7        0x007e

typedef enum KEY_DEF
{
	KEY_NONE	  =	0x7F,	//	无按键
	KEY_LEFT	  =	KEY1,	//	左
	KEY_RIGHT	  =	KEY7,	//	右
	KEY_DOWN	  =	KEY3,	//	下
	KEY_UP		  =	KEY5,	//	上
	KEY_ESC		  =	KEY6,	//	返回
	KEY_ENTER	  =	KEY4,	//	确认
	KEY_RESET	  =	KEY2,	//  复归
	KEY_LONGRESET = 0x0102	//  长按复归键产生的键值
}KEY_DEF;

#define hd_GetKey(ignore)  ((INT16U)FIO2PIN & 0x7F)

/***********************************************
** LCD
************************************************/
//点亮和熄灭液晶
extern void  hd_LightLCD(INT8U bLightOn);
//初始化
extern void GXM12232_SED1520_initlcd(void);
//LCD清屏
extern void hd_LCD_ClearScreen(void);
//对液晶写屏
extern void hd_LCD_WriteData(INT8U x, INT8U y, INT8U val);

#endif
