/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef CTRL_BASE_H
#define	CTRL_BASE_H 
#include "GuiDef.h"
#include "CtrlBase.h"

 

struct GRID_CTRL
{
	CTRL_BASE_DEF
	INT16U     RowCnt;
	INT16U     ColCnt;

	INT16U      MaxShowChars;           //该控件窗口中能显示的字符数
	INT16U      MaxShowLines;           //该控件窗口中能显示的行数

	/*动态滚动条*/
	CGuiRect ScrollBarRect;		//滚动条位置
	INT8U    ShowScrollBar;		//是否显示滚动条


};
typedef struct GRID_CTRL CGuiGridCtrl;
 
#endif
