/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#pragma  once
 

#include "GuiSystem.h"
#include "guilist.h"


 
struct SCREEN_BASE
{
	const void * class;	/* must be first */

	INT8U        ParentID;    //父窗口ID号
	INT8U        CurrentID;   //本窗口ID号
	INT16U       ScreenName; //本窗口名称  字符串的ID

	//回调函数
//	fnOnKeyDown pfnKeyDown;
//	fnOnMessage pfnMessage;
//	fnInit      pfnInit;
//	fnDestory   pfnDestory;
//	fnOnNotify  pfnOnNotify;

//	UEVENT  Event[MAX_ENENT_CNT];
};

typedef struct SCREEN_BASE CScreenBase;
