///////////////////////////////////////////////////////////////
//	文 件 名 : hd_ISR.h
//	文件功能 : 硬件中断服务程序
//	作    者 : 
//	创建时间 : 2007年月日
//	项目名称 : 
//	操作系统 : 
//	备    注 : 
//	历史记录 : 
//////////////////////////////////////////////////////////////

#ifndef HD_ISR_H
#define HD_ISR_H

 

INT16U  OPCODE_AD(INT16U ssp1);

/****************************************************************************
* 名	称：EINT1/2_Exception()
* 功	能：中断服务程序，计数脉冲增减
* 入口参数：无
* 出口参数：无
****************************************************************************/
void EINT1_Exception (void);
void EINT2_Exception (void);

/****************************************************************************
* 名	称：EINT3_Exception()
* 功	能：AD采样
* 入口参数：无
* 出口参数：无
****************************************************************************/
//void  __irq EINT3_Exception (void);
void  EINT3_Exception (void);
/****************************************************************************
* 名	称：Timer1_Exception()
* 功	能：定时器1中断服务，两路脉冲计数
* 入口参数：无
* 出口参数：无
****************************************************************************/
//void Timer1_Exception(void);

/****************************************************************************
* 名	称：Timer2_Exception()
* 功	能：Timer2初始化，用于周立功TCPIP
* 入口参数：无
* 出口参数：无
****************************************************************************/
//void Timer2_Exception(void);

/****************************************************************************
* 名	称：Timer3_Exception()
* 功	能：Timer2初始化，用于周立功Modbus-RTU
* 入口参数：无
* 出口参数：无
****************************************************************************/
void Timer3_Exception(void);

/****************************************************************************
* 名	称：UART0_Exception()
* 功	能：串口0的中断处理
* 入口参数：无
* 出口参数：无
****************************************************************************/
//void  UART0_Exception(void);
//void  UART3_Exception(void);

/****************************************************************************
* 名	称：I2C0_Exception()
* 功	能：I2C中断，通过判断I2C状态字进行相应的操作。
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  I2C1_Exception(void);
void  I2C2_Exception(void);

#endif
