/****************************************Copyright (c)**************************************************
**                                 
**            软时钟的处理，系统时间处理                          
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef DEVICE_TIME_H
#define DEVICE_TIME_H


extern void InitClockMgr( void );

//对外接口，设时  通常由液晶或者通信调用
extern INT8U   ClockSetTime(INT8U hr, INT8U min, INT8U sec);
extern INT8U   ClockSetDate(INT8U month, INT8U day, INT16U year);
extern INT8U   ClockSetDateTime(INT8U month, INT8U day, INT16U year, INT8U hr, INT8U min, INT8U sec);

extern void ClockMgrSignal(INT16U nMsCnt);



#endif
