/****************************************Copyright (c)**************************************************
**                                        IO扫描任务
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  循环扫描IO，并将输入信息填入原始区域
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include <stdlib.h>
#include "includes.h"
#include "func.h"
#include "MemData.h"

#include "hd_drive.h"
#include "IoAdapter.h"
 

/*********************************************************************************************************
** 函数名称: ScanModule
** 函数名称: ScanModule
**
** 功能描述： 扫描模件,和硬件相关
**
** 输　入:  IO * pIo
**          
** 输　出:  INT8U
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2008年9月3日
** 备  注: 
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U ScanInModule( IO  *pIo )
{
	INT32U ChCnt = 0;
	INT32U i = 0;
	INT16U IVal = 0;
	INT16U temp1 = 0;
	INT8U bRet = FALSE;

	if (pIo == NULL)
		return FALSE;

	//开关量
	ChCnt = pIo->DiCfg.ChCnt;
	if ( ChCnt > 0 && ChCnt <= MAX_CH_CNT )
	{
		IVal = hd_GetDigitalIn();
		for ( i = 0; i < ChCnt && i < sizeof(IVal)  ; i++)
		{
			temp1 = 1<<i;
			if( IVal & temp1)
			{
				SetPIBit( 1,  pIo->DiCfg.StartAddr + i );
			}
			else
			{
				SetPIBit( 0,  pIo->DiCfg.StartAddr + i );
			}			
		}
	}
	//模拟量 由于AD的返回值需在中断里面读，所以此处只能启动命令
	ChCnt = pIo->AiCfg.ChCnt;
	if ( ChCnt > 0 && ChCnt <= MAX_CH_CNT )
	{
		for ( i = 0; i < ChCnt ; i++)
		{
			hd_GetAnalogIn( i );//启动扫描？？？
		}
	}

	//读值
	if ( ChCnt > 0 && ChCnt <= MAX_CH_CNT )
	{
		for ( i = 0; i < ChCnt ; i++)
		{
			bRet = GetAinRawVal(i,&temp1);
			if (bRet == TRUE)
			{
				SetPIW( temp1,  pIo->AiCfg.StartAddr + i );
			}			 
		}
	}
	return TRUE;
}

/*********************************************************************************************************
** 函数名称: UpdateModule
** 函数名称: UpdateModule
**
** 功能描述： 输出开出或者模出量
**
** 输　入:  IO * pIo
**          
** 输　出:  INT8U
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2008年9月4日
** 备  注: 
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
INT8U UpdateModule( IO  *pIo )
{
	INT32U ChCnt = 0;

	if (pIo == NULL)
		return FALSE;

	//开关量
	ChCnt = pIo->DoCfg.ChCnt;
	if ( ChCnt > 0 && ChCnt <= MAX_CH_CNT )
	{

	}

	//模拟量输出
	ChCnt = pIo->AoCfg.ChCnt;
	if ( ChCnt > 0 && ChCnt <= MAX_CH_CNT )
	{

	}
}

void IoScnTask(void *pdata)
{

}
