/****************************************Copyright (c)**************************************************
**                                      
**                                      
**                                      
**
**                           
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名:  
**创   建   人:  
**最后修改日期: 
**描        述:  
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人:  
** 版  本:  
** 日　期:  
** 描　述: 
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述:  
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef GUI_CONST_H
#define	GUI_CONST_H
 
typedef enum MENUID                 
{
	ID_WINDOW_NULL=0,			// 无定义窗口ID号
	// 一般画面
	ID_START_WINDOW,			// 启动画面	              静态画面	

	ID_PASSWORD,                // 密码输入窗口           密码输入窗口
	ID_MODALDIALOG,             // 信息显示对话框
	ID_DEFAULTSCREEN,          // 默认显示界面1          循环显示


	ID_INIT_DEFAULT,			// 恢复出厂设置
	//未完

	// 定义最大屏幕数
	MAXSCREEN
}MENUID;


typedef enum LcdMessage
{
	LCD_WM_INI=10,                 // 初始化
	LCD_WM_REFRASH,                // 画面重新刷新 
	LCD_WM_TIMER,                  // 定时器消息
		
	// 键盘消息
	LCD_WM_KEYDOWN,     
		
	LCD_WM_SPECIAL_EVENT=100    // 特殊消息。具体含义由各个画面定义 
}LcdMessage;
 
// 用户密码
#define PWDEFAULT 0000   
// 超级密码
#define SUPERPW   1234    


#endif
